Autodesk.Revit.DB.ImageType
Represents a type containing a raster based image. ImageInstances of this type can be placed in 2D views, sheets, and schedules.
Remarks:
ImageType elements are created with the ImageType.Create(Document, ImageTypeOptions) method.
ImageType elements can be loaded from the following file types: *.bmp, *.jpg, *.jpeg, *.png, *.tif, *.pdf.
Since:
2015